#Salve a base de dados escolhida no seu drive e importe para um notebook do Colab, criando um Dataframe

In [2]:
import pandas as pd
from google.colab import drive
import numpy as np
import random

drive.mount('/drive')
titanic = pd.read_csv("/drive/MyDrive/titanic/class_titanic.csv")

Drive already mounted at /drive; to attempt to forcibly remount, call drive.mount("/drive", force_remount=True).

#Inspecione as colunas do conjunto de dados (Nome das colunas e tipo de dados)

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#Escolha uma coluna com valores numéricos e apague todas as linhas que possuam valor nulo

In [4]:
titanic=titanic.dropna(subset=["Age"])
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Pclass       714 non-null    int64
 2   Name         714 non-null    object
 3   Sex          714 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        714 non-null    int64
 6   Parch        714 non-null    int64
 7   Ticket       714 non-null    object
 8   Fare         714 non-null    float64
 9   Cabin        185 non-null    object
 10  Embarked     712 non-null    object
 11  Survived     714 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 72.5+ KB

#Calcule a média desta mesma coluna

In [5]:
media = titanic["Age"].mean()
print(media)

29.69911764705882

#Escolha um critério para eliminar as linhas que possuam valores muito distantes da média e crie um novo Dataframe.

In [6]:
elimina1=titanic["Age"] > 20
elimina2=titanic["Age"] < 40

titanic=titanic[elimina1]
titanic=titanic[elimina2]

titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 372 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  372 non-null    int64
 1   Pclass       372 non-null    int64
 2   Name         372 non-null    object
 3   Sex          372 non-null    object
 4   Age          372 non-null    float64
 5   SibSp        372 non-null    int64
 6   Parch        372 non-null    int64
 7   Ticket       372 non-null    object
 8   Fare         372 non-null    float64
 9   Cabin        86 non-null     object
 10  Embarked     371 non-null    object
 11  Survived     372 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 37.8+ KB

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """

#Crie um novo Dataframe que contenha apenas 5 colunas do conjunto anterior.

In [7]:
newTitanic = titanic.iloc[:,:5]
newTitanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 372 entries, 0 to 890
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  372 non-null    int64
 1   Pclass       372 non-null    int64
 2   Name         372 non-null    object
 3   Sex          372 non-null    object
 4   Age          372 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 17.4+ KB

#Escolha duas colunas numéricas e crie uma nova coluna que siga a regra: (Coluna A - Coluna B)*número aleatório (entre 0 e 1).

In [8]:
newTitanic.insert(5,"newColuna",((newTitanic["Pclass"]-newTitanic["Age"])*random.random()))
newTitanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 372 entries, 0 to 890
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  372 non-null    int64
 1   Pclass       372 non-null    int64
 2   Name         372 non-null    object
 3   Sex          372 non-null    object
 4   Age          372 non-null    float64
 5   newColuna    372 non-null    float64
dtypes: float64(2), int64(2), object(2)
memory usage: 20.3+ KB

#Embaralhe aleatoriamente o dataframe (índices e valores).

In [9]:
newTitanic.reindex(np.random.permutation(newTitanic.index))

,PassengerId,Pclass,Name,Sex,Age,newColuna
73,74,3,"Chronopoulos, Mr. Apostolos",male,26.0,-12.916081
85,86,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",female,33.0,-16.847062
148,149,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,-19.374121
652,653,3,"Kalvik, Mr. Johannes Halvorsen",male,21.0,-10.108237
141,142,3,"Nysten, Miss. Anna Sofia",female,22.0,-10.669806
...,...,...,...,...,...,...
199,200,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,-12.354512
179,180,3,"Leonard, Mr. Lionel",male,36.0,-18.531768
769,770,3,"Gronnestad, Mr. Daniel Danielsen",male,32.0,-16.285493
693,694,3,"Saad, Mr. Khalil",male,25.0,-12.354512
805,806,3,"Johansson, Mr. Karl Johan",male,31.0,-15.723924

#Ordene o Dataframe seguindo um critério definido por você (Explique o critério)

In [10]:
newTitanic = newTitanic.sort_values(by="Name",ascending=False) 
display(newTitanic)

# O critério escolhido foi que os itens da coluna "Name" serão organizados por ordem decrescente, ou seja, a ordem que o python reconhece das letras do alfabeto, com distinção entre letras maiúculas e minúsculas.

,PassengerId,Pclass,Name,Sex,Age,newColuna
361,362,2,"del Carlo, Mr. Sebastiano",male,29.0,-15.162356
286,287,3,"de Mulder, Mr. Theodore",male,30.0,-15.162356
559,560,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",female,36.0,-18.531768
422,423,3,"Zimmerman, Mr. Leo",male,29.0,-14.600787
199,200,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,-12.354512
...,...,...,...,...,...,...
401,402,3,"Adams, Mr. John",male,26.0,-12.916081
365,366,3,"Adahl, Mr. Mauritz Nils Martin",male,30.0,-15.162356
874,875,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,-14.600787
308,309,2,"Abelson, Mr. Samuel",male,30.0,-15.723924
279,280,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,-17.970199

#Escolha uma coluna numérica e um coluna com strings e utilize a função Groupby para mostrar os totais da  coluna.

In [11]:
colunas = newTitanic.groupby("Age")[["Sex"]].count()  
print(colunas)

      Sex
Age
20.5    1
21.0   24
22.0   27
23.0   15
23.5    1
24.0   30
24.5    1
25.0   23
26.0   18
27.0   18
28.0   25
28.5    2
29.0   20
30.0   25
30.5    2
31.0   17
32.0   18
32.5    2
33.0   15
34.0   15
34.5    1
35.0   18
36.0   22
36.5    1
37.0    6
38.0   11
39.0   14

#Utilize a função MAPS para fazer algum tipo de substituição no Dataframe (explique)

In [12]:
newTitanic["Sex"] = newTitanic["Sex"].map('Sex: {}'.format) 
# A coluna "Sex" agora tem uma "etiqueta" ao lado da opção escolhida
display(newTitanic)

,PassengerId,Pclass,Name,Sex,Age,newColuna
361,362,2,"del Carlo, Mr. Sebastiano",Sex: male,29.0,-15.162356
286,287,3,"de Mulder, Mr. Theodore",Sex: male,30.0,-15.162356
559,560,3,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",Sex: female,36.0,-18.531768
422,423,3,"Zimmerman, Mr. Leo",Sex: male,29.0,-14.600787
199,200,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",Sex: female,24.0,-12.354512
...,...,...,...,...,...,...
401,402,3,"Adams, Mr. John",Sex: male,26.0,-12.916081
365,366,3,"Adahl, Mr. Mauritz Nils Martin",Sex: male,30.0,-15.162356
874,875,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",Sex: female,28.0,-14.600787
308,309,2,"Abelson, Mr. Samuel",Sex: male,30.0,-15.723924
279,280,3,"Abbott, Mrs. Stanton (Rosa Hunt)",Sex: female,35.0,-17.970199

#Exporte o último Dataframe para um arquivo CSV e salve no seu drive

In [13]:
newTitanic.to_csv("/drive/MyDrive/newTitanic.csv")

#Exporte o mesmo Dataframe para um arquivo JSON e salve no seu drive

In [14]:
arqjson = newTitanic.to_json(orient='table')
with  open('/drive/MyDrive/newTitanic.json', 'w') as file:
  file.write(arqjson)